<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8"></meta>
    <title>軟體工程師扶持計畫</title>
    <style type="text/css">
    .title{font-weight: bold;font-size: 20px;color:blue
    }
    .content{width:600px;padding: 10px;border: 1px dashed blue;margin-top: 10px;
    margin-bottom: 10px
    }
     </style>
</head>    
<body>
    <div class="title"><b>兩百字內的個人簡介</b></div>
    <div class="content">彭彭老師你好，我是宏瑋，是一名剛畢業沒多久且剛當完兵一段時間的人，<br>
    我的興趣動態跟靜態的都有，靜態的有看影片、看劇、看小書漫畫等等，動<br>
    態的興趣有健身、打籃球跟慢跑等等，至於個性方面原本是偏內向，跟人溝<br>
    通會比較緊張，甚至遇到不熟的人會緊張，我後來想想這個困難我一定要想<br>
    辦法去克服，所以在大學的時候，我試著參加社團當幹部，有了跟以前相差<br>
    許多的人生經驗，跟人相處做人待人處事的機會多了，我在內向跟比較不敢<br>
    跟人溝通的困難點有改善很多，能夠正常與人交談且在大學結交不少人是我<br>
    最大的收穫，當然以前願意跟我這個極度內向的人當朋友的人我至今還有跟<br>
    不少人聯絡，他們是我很珍惜且重視的羈絆，舉這個例子是想讓老師了解我<br>
    是會為了想要成為或是增進甚麼能力而付出努力的人。</div>
    <div class="title"><b>為什麼想成為工程師 ( 請以自我期許帶入：前端、後端、或全端工程師 )</b></div>
    <div class="content">想要成為工程師的原因有幾個，一個是這個領域薪資相較其他行業是比較高的，<br>
    再來是網路上的資源是真得很多，還有當時在當兵的時候認識很多人，真的覺<br>
    得一技之長真的很重要，有一技之長的人通常在工作上比較不好取代，且可以<br>
    貢獻所學，至於自我期許是希望可以先從前端工程師去努力，原因是我畢竟是<br>
    非本科系務實點先從門檻相對低，加上東西呈現出來會知道自己學了那些，感<br>
    受度會比較強，加上我在寫程式的時候有感受到做出甚麼或是進步了，心理的<br>
    成就感其實滿踏實也滿不錯的。
    </div>
    <div class="title"><b>為了成為工程師，曾經做過什麼努力？</b></div>
    <div class="content">我現在有在看開放式課程，也有看了不少彭彭老師的影片，python的課程我有一<br>
    一去練習，為了彌補跟本科系的差距，我去各名校的開放式課程找課來看，先是<br>
    台大的計算機程式，接著會是計算機概論，然後清大跟交大的課程有資料結構跟<br>
    演算法，我目前就是一天一集來努力學習，以及看網路上開放式課程以及網路上<br>
    關於PTYHON以及前端網路上講解的題目去努力，之後高中生解題網上去做題，<br>
    厲害點後會去Leetcode去刷題。</div>
    <div class="title"><b>對於工程師的職業想像是什麼？</b></div>
    <div class="content">靠專業技能去解決問題，每天下班後最好撥一些時間出來學習，是一個踏入就要<br>
        要求自己一職進步的工作，工作上是跟一群專業的人合作去完成案子，看到人用<br>
        自己的產品得到成就感，每天的時間規劃都很重要。 

    </div>
  
    <div class="title"><b>如果參與這個計畫，會怎麼安排學習時間？</b></div>
    <div class="content">我前陣子是有邊打工邊考試，11月15考完後，就開始慢慢摸索程式，剛好表格上<br>
    有問是有上班或是待業，我直接來回答，我觀察這個課程是從2月20開始，第二階段<br>
    是從4月開始，我預計會在課程開始前運用打工賺好學費跟部分生活費，我變成是晚<br>
    上打工，早上到18:00預計有六小起碼的時間學習，加上一周會有兩天的休假，休假<br>
    全心投入，一周40-60小時的投入是可以做到的，再來如果我到了第二或是第三階段<br>
    會直接把工作辭了全心投入學習。

    </div>
    <div class="title"><b>如果參與這個計畫，預期會碰到什麼困難？你打算怎麼解決它？</b></div>
    <div class="content">困難嘛，很多事情可能是會出現無法出現獲預期的，生活上、課程上可能都有，生<br>
    活上的話要靠自己努力解決或是找人幫助，課程上就是努力聽課努力學習，遇到不會<br>
    的先找出問題點，再一一拆招，詢問助教或實體課程把問題點描述出來，真的主要靠<br>
    自己想辦法解決，這樣進步會比較迅速，成為工程師後就是要靠自己想辦法獨立，不<br>
    太可能像小朋友期待每次都有人看到你跌倒，然後幫你拍拍灰塵扶你站起來，我認為<br>
    遇到困難最根本的方法就是持續學習進步，找到問題點求救加上解決後繼續進步努力。

    </div>
    <div class="title"><b>想要對我們說的事情？</b></div>
    <div class="content">剛好在學習的路上看到彭彭老師有這個計畫，很感激，也很感謝彭彭老師願意讓<br>
        我們可以在您的平台學習，老師教導從根本教起，讓我這位非本科的人學習起來<br>
        不會聽不懂，看到留言上有不會的地方彭彭老師也願意去幫大家解答，感謝真的<br>
        太多了。

    </div>
</body>
</html>    
